Информационная_база/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база/src/Documents/ВКМ_ВыплатаЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ЗаполнитьВыплаты(Команда)
	ЗаполнитьВыплатыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
 Процедура ЗаполнитьВыплатыНаСервере()

 	Запрос = Новый Запрос;
 	Запрос.Текст =
 		"ВЫБРАТЬ
 		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
 		|	ЕСТЬNULL(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток, 0) КАК Сумма
 		|ИЗ
 		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
 	
 	РезультатЗапроса = Запрос.Выполнить();
 	
 	Если РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = "Нет данных для формирования зарплатной ведомости.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
 	
 	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		Если Объект.Выплаты.НайтиСтроки(Новый Структура("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник)).Количество() = 0 Тогда
			ЗаполнитьЗначенияСвойств(Объект.Выплаты.Добавить(), ВыборкаДетальныеЗаписи); 
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


#КонецОбласти
